; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v8 ?v12)
             (pred_12 ?v13 ?v4)
             (pred_4 ?v8 ?v4)
             (pred_2 ?v11 ?v8 )
	     (pred_5 ?v8)
             (pred_7 ?v5)
             (pred_3 ?v13)
             (pred_8 ?v4)
             (pred_1 ?v8)
             (pred_9 ?v13)
             (pred_10 ?v8)
             (pred_11 ))



(:action op_3
:parameters (?v9 ?v2 ?v6 ?v7)
:precondition (and (pred_7 ?v9) (pred_7 ?v2) (pred_3 ?v6) (pred_8 ?v7)
          (pred_6 ?v9 ?v2) (pred_12 ?v6 ?v7)
                   (pred_4 ?v2 ?v7) (pred_5 ?v9) 
                   (pred_1 ?v2) (pred_9 ?v6))
:effect (and  (pred_10 ?v2) (not (pred_1 ?v2))))


(:action op_1
:parameters (?v9 ?v10)
:precondition (and (pred_7 ?v9) (pred_7 ?v10)
               (pred_5 ?v9) (pred_6 ?v9 ?v10) (pred_10 ?v10))
:effect (and (pred_5 ?v10) (not (pred_5 ?v9))))

(:action op_4
:parameters (?v9 ?v6)
:precondition (and (pred_7 ?v9) (pred_3 ?v6) 
                  (pred_5 ?v9) (pred_2 ?v6 ?v9) (pred_11 ))
:effect (and (pred_9 ?v6)
   (not (pred_2 ?v6 ?v9)) (not (pred_11 ))))


(:action op_2
:parameters (?v9 ?v3 ?v1)
:precondition (and (pred_7 ?v9) (pred_3 ?v3) (pred_3 ?v1)
                  (pred_5 ?v9) (pred_9 ?v1) (pred_2 ?v3 ?v9))
:effect (and (pred_9 ?v3) (pred_2 ?v1 ?v9)
        (not (pred_9 ?v1)) (not (pred_2 ?v3 ?v9))))

(:action op_5
:parameters (?v9 ?v6)
:precondition (and (pred_7 ?v9) (pred_3 ?v6) 
                  (pred_5 ?v9) (pred_9 ?v6))
:effect (and (pred_11 ) (pred_2 ?v6 ?v9) (not (pred_9 ?v6)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_18 obj_23 obj_31 obj_14 obj_05 obj_21 obj_07 obj_25 obj_17 obj_30 obj_19 obj_01 obj_11 obj_22 obj_26 obj_16 obj_04 obj_02 obj_20 obj_03 obj_08 obj_06 obj_13 obj_24 obj_27
    obj_28 obj_09 obj_29
    obj_15 obj_12 obj_10
    )

    (:init
       (pred_11)

       (pred_7 obj_18)
       (pred_7 obj_23)
       (pred_7 obj_31)
       (pred_7 obj_14)
       (pred_7 obj_05)
       (pred_7 obj_21)
       (pred_7 obj_07)
       (pred_7 obj_25)
       (pred_7 obj_17)
       (pred_7 obj_30)
       (pred_7 obj_19)
       (pred_7 obj_01)
       (pred_7 obj_11)
       (pred_7 obj_22)
       (pred_7 obj_26)
       (pred_7 obj_16)
       (pred_7 obj_04)
       (pred_7 obj_02)
       (pred_7 obj_20)
       (pred_7 obj_03)
       (pred_7 obj_08)
       (pred_7 obj_06)
       (pred_7 obj_13)
       (pred_7 obj_24)
       (pred_7 obj_27)
       (pred_8 obj_28)
       (pred_8 obj_09)
       (pred_8 obj_29)
       (pred_3 obj_15)
       (pred_3 obj_12)
       (pred_3 obj_10)

       (pred_6 obj_18 obj_21)
       (pred_6 obj_18 obj_23)
       (pred_6 obj_23 obj_07)
       (pred_6 obj_23 obj_31)
       (pred_6 obj_23 obj_18)
       (pred_6 obj_31 obj_25)
       (pred_6 obj_31 obj_14)
       (pred_6 obj_31 obj_23)
       (pred_6 obj_14 obj_17)
       (pred_6 obj_14 obj_05)
       (pred_6 obj_14 obj_31)
       (pred_6 obj_05 obj_30)
       (pred_6 obj_05 obj_14)
       (pred_6 obj_21 obj_19)
       (pred_6 obj_21 obj_07)
       (pred_6 obj_21 obj_18)
       (pred_6 obj_07 obj_01)
       (pred_6 obj_07 obj_25)
       (pred_6 obj_07 obj_23)
       (pred_6 obj_07 obj_21)
       (pred_6 obj_25 obj_11)
       (pred_6 obj_25 obj_17)
       (pred_6 obj_25 obj_31)
       (pred_6 obj_25 obj_07)
       (pred_6 obj_17 obj_22)
       (pred_6 obj_17 obj_30)
       (pred_6 obj_17 obj_14)
       (pred_6 obj_17 obj_25)
       (pred_6 obj_30 obj_26)
       (pred_6 obj_30 obj_05)
       (pred_6 obj_30 obj_17)
       (pred_6 obj_19 obj_16)
       (pred_6 obj_19 obj_01)
       (pred_6 obj_19 obj_21)
       (pred_6 obj_01 obj_04)
       (pred_6 obj_01 obj_11)
       (pred_6 obj_01 obj_07)
       (pred_6 obj_01 obj_19)
       (pred_6 obj_11 obj_02)
       (pred_6 obj_11 obj_22)
       (pred_6 obj_11 obj_25)
       (pred_6 obj_11 obj_01)
       (pred_6 obj_22 obj_20)
       (pred_6 obj_22 obj_26)
       (pred_6 obj_22 obj_17)
       (pred_6 obj_22 obj_11)
       (pred_6 obj_26 obj_03)
       (pred_6 obj_26 obj_30)
       (pred_6 obj_26 obj_22)
       (pred_6 obj_16 obj_08)
       (pred_6 obj_16 obj_04)
       (pred_6 obj_16 obj_19)
       (pred_6 obj_04 obj_06)
       (pred_6 obj_04 obj_02)
       (pred_6 obj_04 obj_01)
       (pred_6 obj_04 obj_16)
       (pred_6 obj_02 obj_13)
       (pred_6 obj_02 obj_20)
       (pred_6 obj_02 obj_11)
       (pred_6 obj_02 obj_04)
       (pred_6 obj_20 obj_24)
       (pred_6 obj_20 obj_03)
       (pred_6 obj_20 obj_22)
       (pred_6 obj_20 obj_02)
       (pred_6 obj_03 obj_27)
       (pred_6 obj_03 obj_26)
       (pred_6 obj_03 obj_20)
       (pred_6 obj_08 obj_06)
       (pred_6 obj_08 obj_16)
       (pred_6 obj_06 obj_13)
       (pred_6 obj_06 obj_04)
       (pred_6 obj_06 obj_08)
       (pred_6 obj_13 obj_24)
       (pred_6 obj_13 obj_02)
       (pred_6 obj_13 obj_06)
       (pred_6 obj_24 obj_27)
       (pred_6 obj_24 obj_20)
       (pred_6 obj_24 obj_13)
       (pred_6 obj_27 obj_03)
       (pred_6 obj_27 obj_24)
       (pred_1 obj_11)
       (pred_1 obj_03)
       (pred_1 obj_30)
       (pred_4  obj_11 obj_28)
       (pred_4  obj_03 obj_09)
       (pred_4  obj_30 obj_29)
       (pred_10 obj_18)
       (pred_10 obj_23)
       (pred_10 obj_31)
       (pred_10 obj_14)
       (pred_10 obj_05)
       (pred_10 obj_21)
       (pred_10 obj_07)
       (pred_10 obj_25)
       (pred_10 obj_17)
       (pred_10 obj_19)
       (pred_10 obj_01)
       (pred_10 obj_22)
       (pred_10 obj_26)
       (pred_10 obj_16)
       (pred_10 obj_04)
       (pred_10 obj_02)
       (pred_10 obj_20)
       (pred_10 obj_08)
       (pred_10 obj_06)
       (pred_10 obj_13)
       (pred_10 obj_24)
       (pred_10 obj_27)

       (pred_12  obj_15 obj_28)
       (pred_12  obj_12 obj_09)
       (pred_12  obj_10 obj_29)
       (pred_2 obj_15 obj_16)
       (pred_2 obj_12 obj_22)
       (pred_2 obj_10 obj_08)
       (pred_5 obj_31)
    )

    (:goal (and
       (pred_2 obj_10 obj_25)
    ))
(:constraints
  (always (not (pred_5 obj_07)))
)
)

; plan
1. (op_1 obj_31 obj_23)
   deleted: (pred_5 obj_31)
   added: (pred_5 obj_23)
   goals met: 0 of 1
2. (op_1 obj_23 obj_18)
   deleted: (pred_5 obj_23)
   added: (pred_5 obj_18)
   goals met: 0 of 1
3. (op_1 obj_18 obj_21)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_21)
   goals met: 0 of 1
4. (op_1 obj_21 obj_19)
   deleted: (pred_5 obj_21)
   added: (pred_5 obj_19)
   goals met: 0 of 1
5. (op_1 obj_19 obj_16)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_16)
   goals met: 0 of 1
6. (op_1 obj_16 obj_08)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_08)
   goals met: 0 of 1
7. (op_4 obj_08 obj_10)
   deleted: (pred_2 obj_10 obj_08) (pred_11)
   added: (pred_9 obj_10)
   goals met: 0 of 1
8. (op_1 obj_08 obj_16)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_16)
   goals met: 0 of 1
9. (op_1 obj_16 obj_19)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_19)
   goals met: 0 of 1
10. (op_1 obj_19 obj_21)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_21)
   goals met: 0 of 1
11. (op_1 obj_21 obj_18)
   deleted: (pred_5 obj_21)
   added: (pred_5 obj_18)
   goals met: 0 of 1
12. (op_1 obj_18 obj_23)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_23)
   goals met: 0 of 1
13. (op_1 obj_23 obj_31)
   deleted: (pred_5 obj_23)
   added: (pred_5 obj_31)
   goals met: 0 of 1
14. (op_1 obj_31 obj_25)
   deleted: (pred_5 obj_31)
   added: (pred_5 obj_25)
   goals met: 0 of 1
15. (op_5 obj_25 obj_10)
   deleted: (pred_9 obj_10)
   added: (pred_11) (pred_2 obj_10 obj_25)
   goals met: 1 of 1
